uhnp/src/InformationRegisters/ОбъектыУчетаДокументовЭДО/ОбъектыУчетаДокументовЭДО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОбъектыУчетаДокументовЭДО</name>
  <resources>
    <name>СпособОбработки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Актуальный</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ТребуетсяПересчетАктуальности</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>ЭлектронныйДокумент</name>
    <type>
      <types>DocumentRef.ЭлектронныйДокументВходящийЭДО</types>
      <types>DocumentRef.ЭлектронныйДокументИсходящийЭДО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектУчета</name>
    <type>
      <types>DefinedType.ОснованияЭлектронныхДокументовЭДО</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/Enums/ТипыДокументовЭДО/ТипыДокументовЭДО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыДокументовЭДО</name>
  <enumValues>
    <name>АктВзаимозачета</name>
  </enumValues>
  <enumValues>
    <name>АктВыполненныхРабот</name>
  </enumValues>
  <enumValues>
    <name>АктНаПередачуПрав</name>
  </enumValues>
  <enumValues>
    <name>АктОРасхождениях</name>
  </enumValues>
  <enumValues>
    <name>АктСверки</name>
  </enumValues>
  <enumValues>
    <name>АктСверкиВзаиморасчетов</name>
  </enumValues>
  <enumValues>
    <name>Ведомость</name>
  </enumValues>
  <enumValues>
    <name>Внутренний</name>
  </enumValues>
  <enumValues>
    <name>ВозвратТоваровМеждуОрганизациями</name>
  </enumValues>
  <enumValues>
    <name>ГарантийноеПисьмо</name>
  </enumValues>
  <enumValues>
    <name>Договор</name>
  </enumValues>
  <enumValues>
    <name>ДоговорныйДокумент</name>
  </enumValues>
  <enumValues>
    <name>ДокументПриемкиЕИСУКД</name>
    <comment>Титул поставщика из ЕИС</comment>
  </enumValues>
  <enumValues>
    <name>ДокументПриемкиЕИСУПД</name>
    <comment>Титул поставщика из ЕИС</comment>
  </enumValues>
  <enumValues>
    <name>ДополнительноеСоглашение</name>
  </enumValues>
  <enumValues>
    <name>ЗаказТовара</name>
  </enumValues>
  <enumValues>
    <name>ЗапросКоммерческихПредложений</name>
  </enumValues>
  <enumValues>
    <name>ИзвещениеОбОшибкеЕИС</name>
  </enumValues>
  <enumValues>
    <name>ИзвещениеОПолучении</name>
  </enumValues>
  <enumValues>
    <name>КаталогТоваров</name>
  </enumValues>
  <enumValues>
    <name>КвитанцияЕИС</name>
  </enumValues>
  <enumValues>
    <name>КоммерческоеПредложение</name>
  </enumValues>
  <enumValues>
    <name>КонтрактЕИС</name>
  </enumValues>
  <enumValues>
    <name>КорректировкаСведенийОЗакупкеКомиссионером</name>
  </enumValues>
  <enumValues>
    <name>КорректировкаСведенийОРеализацииКомиссионером</name>
  </enumValues>
  <enumValues>
    <name>КорректировочныйСчетФактура</name>
  </enumValues>
  <enumValues>
    <name>КС11</name>
  </enumValues>
  <enumValues>
    <name>КС2</name>
  </enumValues>
  <enumValues>
    <name>КС3</name>
  </enumValues>
  <enumValues>
    <name>МашиночитаемаяДоверенность</name>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗаказ</name>
  </enumValues>
  <enumValues>
    <name>Отчет</name>
  </enumValues>
  <enumValues>
    <name>ОтчетОПродажахКомиссионногоТовара</name>
  </enumValues>
  <enumValues>
    <name>ОтчетОСписанииКомиссионногоТовара</name>
  </enumValues>
  <enumValues>
    <name>ПередачаТоваровМеждуОрганизациями</name>
  </enumValues>
  <enumValues>
    <name>ПлатежноеПоручение</name>
  </enumValues>
  <enumValues>
    <name>ПодтверждениеОператораЭДО</name>
  </enumValues>
  <enumValues>
    <name>ПрайсЛист</name>
  </enumValues>
  <enumValues>
    <name>ПредложениеОбАннулировании</name>
  </enumValues>
  <enumValues>
    <name>Прикладной</name>
  </enumValues>
  <enumValues>
    <name>ПриложениеДляЕИС</name>
  </enumValues>
  <enumValues>
    <name>ПриложениеКАкту</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
  </enumValues>
  <enumValues>
    <name>РезультатРассмотренияАктаПриемкиЕИСУКД</name>
  </enumValues>
  <enumValues>
    <name>РезультатРассмотренияАктаПриемкиЕИСУПД</name>
  </enumValues>
  <enumValues>
    <name>РеквизитыОрганизации</name>
  </enumValues>
  <enumValues>
    <name>СведенияОЗакупкеКомиссионером</name>
  </enumValues>
  <enumValues>
    <name>СведенияОРеализацииКомиссионером</name>
  </enumValues>
  <enumValues>
    <name>СоглашениеОбИзмененииСтоимости</name>
  </enumValues>
  <enumValues>
    <name>СоглашениеОбЭДО</name>
  </enumValues>
  <enumValues>
    <name>Спецификация</name>
  </enumValues>
  <enumValues>
    <name>СчетНаОплату</name>
  </enumValues>
  <enumValues>
    <name>СчетФактура</name>
  </enumValues>
  <enumValues>
    <name>ТоварнаяНакладная</name>
  </enumValues>
  <enumValues>
    <name>Уведомление</name>
  </enumValues>
  <enumValues>
    <name>УведомлениеОбУточнении</name>
  </enumValues>
  <enumValues>
    <name>УведомлениеОПринятииКУчету</name>
  </enumValues>
  <enumValues>
    <name>УдалитьАктЗаказчик</name>
  </enumValues>
  <enumValues>
    <name>УдалитьАктИсполнитель</name>
  </enumValues>
  <enumValues>
    <name>УдалитьВыпискаБанка</name>
  </enumValues>
  <enumValues>
    <name>УдалитьДопДанные</name>
  </enumValues>
  <enumValues>
    <name>УдалитьЗапросВыписки</name>
  </enumValues>
  <enumValues>
    <name>УдалитьЗапросЗонд</name>
  </enumValues>
  <enumValues>
    <name>УдалитьЗапросНаОтзывЭД</name>
  </enumValues>
  <enumValues>
    <name>УдалитьЗапросНочнойВыписки</name>
  </enumValues>
  <enumValues>
    <name>УдалитьЗапросОСостоянииЭД</name>
  </enumValues>
  <enumValues>
    <name>УдалитьИзвещениеОСостоянииЭД</name>
  </enumValues>
  <enumValues>
    <name>УдалитьКвитанция</name>
  </enumValues>
  <enumValues>
    <name>УдалитьОшибка</name>
  </enumValues>
  <enumValues>
    <name>УдалитьПлатежноеПоручение</name>
  </enumValues>
  <enumValues>
    <name>УдалитьПлатежноеТребование</name>
  </enumValues>
  <enumValues>
    <name>УдалитьПроизвольный</name>
  </enumValues>
  <enumValues>
    <name>УдалитьСоглашениеОбИзмененииСтоимостиПолучатель</name>
  </enumValues>
  <enumValues>
    <name>УдалитьТОРГ12</name>
  </enumValues>
  <enumValues>
    <name>УдалитьТОРГ12Покупатель</name>
  </enumValues>
  <enumValues>
    <name>УдалитьУКД_ИнформацияПокупателя</name>
  </enumValues>
  <enumValues>
    <name>УдалитьУКД_ИнформацияПродавца</name>
  </enumValues>
  <enumValues>
    <name>УдалитьУПД_ИнформацияПокупателя</name>
  </enumValues>
  <enumValues>
    <name>УдалитьУПД_ИнформацияПродавца</name>
  </enumValues>
  <enumValues>
    <name>УКД</name>
  </enumValues>
  <enumValues>
    <name>УПД</name>
  </enumValues>
  <enumValues>
    <name>ЭЗН</name>
  </enumValues>
  <enumValues>
    <name>ЭСВ</name>
  </enumValues>
  <enumValues>
    <name>АктПриемкиСтроительныхРаботУслуг</name>
  </enumValues>
  <enumValues>
    <name>ЭТрН</name>
  </enumValues>
  <enumValues>
    <name>ЭЗЗ</name>
  </enumValues>
  <enumValues>
    <name>ЭПЛ</name>
  </enumValues>
  <enumValues>
    <name>ЭДФ</name>
  </enumValues>
  <enumValues>
    <name>ДокументПредприятия</name>
  </enumValues>
  <enumValues>
    <name>ДопСведенияПоРезультатамПриемки</name>
  </enumValues>
  <enumValues>
    <name>УниверсальноеСообщение</name>
  </enumValues>
  <enumValues>
    <name>СчетОферта</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/CommonModules/ОбщегоНазначенияЛокализация/Module.bsl
#Область ПрограммныйИнтерфейс

// Определяет объекты метаданных и отдельные реквизиты, которые исключаются из результатов поиска ссылок,
// не учитываются при монопольном удалении помеченных, замене ссылок и в отчете по местам использования.
//
// См. ОбщегоНазначенияПереопределяемый.ПриДобавленииИсключенийПоискаСсылок
//
Процедура ПриДобавленииИсключенийПоискаСсылок(ИсключенияПоискаСсылок) Экспорт
	
	//++ Локализация

	//++ НЕ УТ

	//-- НЕ УТ

	//-- Локализация
	
КонецПроцедуры

// Определяет соответствие имен параметров сеанса и обработчиков для их установки.
//
// В указанных модулях должна быть размещена процедура обработчика, в которую передаются параметры
//  ИмяПараметра           - Строка - имя параметра сеанса, который требуется установить.
//  УстановленныеПараметры - Массив - имена параметров, которые уже установлены.
// 
// Далее пример процедуры обработчика для копирования в указанные модули.
//
// См. ОбщегоНазначенияПереопределяемый.ПриДобавленииОбработчиковУстановкиПараметровСеанса.
//
Процедура ПриДобавленииОбработчиковУстановкиПараметровСеанса(Обработчики) Экспорт
	
	//++ Локализация
	
	// ИнтеграцияЕГАИС
	Обработчики.Вставить("ИдентификаторСеансаЕГАИС" , "ИнтеграцияЕГАИС.УстановитьПараметрыСеанса");
	// Конец ИнтеграцияЕГАИС
	Обработчики.Вставить("НастройкиРазбораКодаМаркировкиИС",   "ОбщегоНазначенияИС.УстановитьПараметрыСеанса");
	Обработчики.Вставить("ПараметрыЛогированияЗапросовИСМП",   "ОбщегоНазначенияИСМП.УстановитьПараметрыСеанса");
	Обработчики.Вставить("ПараметрыЛогированияЗапросовЗЕРНО",  "ИнтеграцияЗЕРНО.УстановитьПараметрыСеанса");
	Обработчики.Вставить("ПараметрыЛогированияЗапросовВЕТИС",  "ИнтеграцияВЕТИС.УстановитьПараметрыСеанса");
	Обработчики.Вставить("ПараметрыЛогированияЗапросовСАТУРН", "ИнтеграцияСАТУРН.УстановитьПараметрыСеанса");
	Обработчики.Вставить("ДанныеКлючаСессииИСМП",              "ОбщегоНазначенияИСМП.УстановитьПараметрыСеанса");
	Обработчики.Вставить("ДанныеКлючаСессииИСМПРозница",       "ОбщегоНазначенияИСМП.УстановитьПараметрыСеанса");
	Обработчики.Вставить("ДанныеКлючаСессииСАТУРН",            "ИнтеграцияСАТУРН.УстановитьПараметрыСеанса");
	Обработчики.Вставить("CDNПлощадкиСОшибкамиОбменаИСМП",     "ОбщегоНазначенияИСМП.УстановитьПараметрыСеанса");
	
	// ИнтернетПоддержкаПользователей
	ИнтеграцияПодсистемБИП.ПриДобавленииОбработчиковУстановкиПараметровСеанса(Обработчики);
	// Конец ИнтернетПоддержкаПользователей
	
	//++ НЕ УТ

	// ЗарплатаКадрыРасширенный
	ЗарплатаКадрыРасширенный.ПриДобавленииОбработчиковУстановкиПараметровСеанса(Обработчики);
	// Конец ЗарплатаКадрыРасширенный
	
	ОбщегоНазначенияБРО.ОбработчикиИнициализацииПараметровСеанса(Обработчики);
	
	// УниверсальныйОбменСБанками
	УниверсальныйОбменСБанками.ОбработчикиИнициализацииПараметровСеанса(Обработчики);
	// Конец УниверсальныйОбменСБанками

	//-- НЕ УТ
	
	// ЭлектронноеВзаимодействие
	ЭлектронноеВзаимодействие.ПриДобавленииОбработчиковУстановкиПараметровСеанса(Обработчики);
	// Конец ЭлектронноеВзаимодействие
	
	//-- Локализация
	
	Возврат;
	
КонецПроцедуры

// Позволяет задать значения параметров, необходимых для работы клиентского кода
// конфигурации без дополнительных серверных вызовов.
// 
// см. ОбщегоНазначенияПереопределяемый.ПриДобавленииПараметровРаботыКлиента
//
Процедура ПриДобавленииПараметровРаботыКлиента(Параметры) Экспорт
	
	//++ Локализация
	// ИнтернетПоддержкаПользователей
	ИнтеграцияПодсистемБИП.ПриДобавленииПараметровРаботыКлиента(Параметры);
	// Конец ИнтернетПоддержкаПользователей
	
	//++ НЕ УТ
	
	ОбщегоНазначенияБРО.ПриДобавленииПараметровРаботыКлиента(Параметры);
	
	//-- НЕ УТ
	
	ОбщегоНазначенияИС.ПриДобавленииПараметровРаботыКлиента(Параметры);

	// ЭлектронноеВзаимодействие
	ЭлектронноеВзаимодействие.ПриДобавленииПараметровРаботыКлиента(Параметры);
	// Конец ЭлектронноеВзаимодействие
	
	//-- Локализация
	Возврат;
	
КонецПроцедуры

// см. ОбщегоНазначенияПереопределяемый.ПередЗапускомПрограммы
Процедура ПередЗапускомПрограммы() Экспорт
	
	//++ Локализация
	
	// ЭлектронноеВзаимодействие
	ЭлектронноеВзаимодействие.ПередЗапускомПрограммы();
	// Конец ЭлектронноеВзаимодействие
	
	// Маг1С
	Маг1ССервер.ПередЗапускомПрограммы();
	// Конец Маг1С
	
	//-- Локализация
	
КонецПроцедуры

// Позволяет задать значения параметров, необходимых для работы клиентского кода
// при запуске конфигурации (в обработчиках событий ПередНачаломРаботыСистемы и ПриНачалеРаботыСистемы) 
// без дополнительных серверных вызовов. 
// 
// см. ОбщегоНазначенияПереопределяемый.ПриДобавленииПараметровРаботыКлиентаПриЗапуске
//
Процедура ПриДобавленииПараметровРаботыКлиентаПриЗапуске(Параметры) Экспорт
	
	//++ Локализация
	
	Если ОбщегоНазначения.ДоступноИспользованиеРазделенныхДанных() Тогда
	
		// ИнтернетПоддержкаПользователей
		ИнтеграцияПодсистемБИП.ПриДобавленииПараметровРаботыКлиентаПриЗапуске(Параметры);
		// Конец ИнтернетПоддержкаПользователей
		
		// ЭлектронноеВзаимодействие
		ЭлектронноеВзаимодействие.ПараметрыРаботыКлиентаПриЗапуске(Параметры);
		// Конец ЭлектронноеВзаимодействие
		
		//++ НЕ УТ
		ОбщегоНазначенияБРО.ПараметрыРаботыКлиентаПриЗапуске(Параметры);
		
		// ЗарплатаКадрыРасширенный
		ЗарплатаКадры.ПриДобавленииПараметровРаботыКлиентаПриЗапуске(Параметры);
		// Конец ЗарплатаКадрыРасширенный
	
		//-- НЕ УТ
		
		ИнтеграцияЕГАИС.ПараметрыРаботыКлиентаПриЗапуске(Параметры);
		
	КонецЕсли;
	
	//-- Локализация
	Возврат;
	
КонецПроцедуры

// Вызывается при обновлении информационной базы для учета переименований подсистем и ролей в конфигурации.
//  
// см. ОбщегоНазначенияПереопределяемый.ПриДобавленииПереименованийОбъектовМетаданных
//
Процедура ПриДобавленииПереименованийОбъектовМетаданных(Итог) Экспорт

	//++ Локализация

	//++ НЕ УТ
	ЗарплатаКадры.ПриДобавленииПереименованийОбъектовМетаданных(Итог);	
	//-- НЕ УТ
	
	// ИнтернетПоддержкаПользователей
	ИнтеграцияПодсистемБИП.ПриДобавленииПереименованийОбъектовМетаданных(Итог);
	// Конец ИнтернетПоддержкаПользователей
	
	// ЭлектронноеВзаимодействие
	ЭлектронноеВзаимодействие.ПриДобавленииПереименованийОбъектовМетаданных(Итог);
	// Конец ЭлектронноеВзаимодействие
	//-- Локализация
	Возврат;

КонецПроцедуры

// Определяет список версий программных интерфейсов, доступных через web-сервис InterfaceVersion.
// 
// См. ОбщегоНазначенияПереопределяемый.ПриОпределенииПоддерживаемыхВерсийПрограммныхИнтерфейсов
//
Процедура ПриОпределенииПоддерживаемыхВерсийПрограммныхИнтерфейсов(ПоддерживаемыеВерсии) Экспорт

	//++ Локализация

	//++ НЕ УТ
	ОбщегоНазначенияБРО.ПриОпределенииПоддерживаемыхВерсийПрограммныхИнтерфейсов(ПоддерживаемыеВерсии);
	//-- НЕ УТ

	//-- Локализация
	Возврат;
	
КонецПроцедуры

// См. ОбщегоНазначенияПереопределяемый.ПриДобавленииСерверныхОповещений
Процедура ПриДобавленииСерверныхОповещений(Оповещения) Экспорт

	//++ Локализация
	
	// ЭлектронноеВзаимодействие
	ЭлектронноеВзаимодействие.ПриДобавленииСерверныхОповещений(Оповещения);
	// Конец ЭлектронноеВзаимодействие
	
	ИнтеграцияЗЕРНО.ПриДобавленииСерверныхОповещений(Оповещения);
	
	// ИнтеграцияСМаркетплейсами
	ИнтеграцияСМаркетплейсамиСервер.ПриДобавленииСерверныхОповещений(Оповещения);
	// Конец ИнтеграцияСМаркетплейсами
	
	//-- Локализация
	
КонецПроцедуры

//см. ОбщегоНазначенияПереопределяемый.ПриПериодическомПолученииДанныхКлиентаНаСервере
Процедура ПриПериодическомПолученииДанныхКлиентаНаСервере(Параметры, Результаты) Экспорт
	
	//++ Локализация
	
	ИнтеграцияЗЕРНО.ПриПериодическомПолученииДанныхКлиентаНаСервере(Параметры, Результаты);
	ОбщегоНазначенияЕГАИС.ПриПериодическомПолученииДанныхКлиентаНаСервере(Параметры, Результаты);
	
	//-- Локализация
	
КонецПроцедуры

// Позволяет определить наименования напечатанных основных печатных форм из других источников, например получить
// наименование документа, отпраленного по системе ЭДО.
//
// Параметры:
//  ОбъектыУчета - ЛюбаяСсылка
//               - Массив из ОпределяемыйТип.ОбъектСОсновнымиПечатнымиФормами - объекты, для которых необходимо
//                                                                              получить наименование печатных форм.
//  ПредставленияДокументов - Соответствие из КлючИЗначение - Соответствие документов и наименований для печати:
//               * Ключ     - ОпределяемыйТип.ОбъектСОсновнымиПечатнымиФормами - ссылка на документ.
//               * Значение - Строка, Неопределено - представление для печати.
//
Процедура ПриПолученииНаименованийНапечатанныхОсновныхПечатныхФорм(ОбъектыУчета, ПредставленияДокументов) Экспорт
	
	//++ Локализация
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ОбъектыУчетаДокументовЭДО.ОбъектУчета КАК ОбъектУчета,
		|	ОбъектыУчетаДокументовЭДО.ЭлектронныйДокумент.ВидДокумента.ТипДокумента КАК ТипДокумента,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ОбъектыУчетаДокументовЭДО.ЭлектронныйДокумент.ВидДокумента) КАК ВидДокумента
		|ИЗ
		|	РегистрСведений.ОбъектыУчетаДокументовЭДО КАК ОбъектыУчетаДокументовЭДО
		|ГДЕ
		|	ОбъектыУчетаДокументовЭДО.ОбъектУчета В (&ОбъектыУчета)
		|	И ОбъектыУчетаДокументовЭДО.Актуальный";
	Запрос.УстановитьПараметр("ОбъектыУчета", ОбъектыУчета);
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() И Выборка.ТипДокумента <> Перечисления.ТипыДокументовЭДО.Прочее Цикл
		ПредставленияДокументов[Выборка.ОбъектУчета] = Выборка.ВидДокумента;
	КонецЦикла;
	
	//-- Локализация
	
КонецПроцедуры

#Область УстаревшиеПроцедурыИФункции

// см. ОбщегоНазначенияПереопределяемый.ПриДобавленииПараметровРаботыКлиентаПриЗапуске
//
Процедура ПараметрыРаботыКлиентаПриЗапуске(Параметры) Экспорт

	//++ Локализация
	// ИнтернетПоддержкаПользователей
	ИнтеграцияПодсистемБИП.ПриДобавленииПараметровРаботыКлиентаПриЗапуске(Параметры);
	// Конец ИнтернетПоддержкаПользователей
	
	//++ НЕ УТ
	ОбщегоНазначенияБРО.ПараметрыРаботыКлиентаПриЗапуске(Параметры);
	//-- НЕ УТ

	//-- Локализация

КонецПроцедуры

// см. ОбщегоНазначенияПереопределяемый.ПриДобавленииПараметровРаботыКлиента
//
Процедура ПараметрыРаботыКлиента(Параметры) Экспорт
	
	//++ Локализация
	// ИнтернетПоддержкаПользователей
	ИнтеграцияПодсистемБИП.ПриДобавленииПараметровРаботыКлиента(Параметры);
	// Конец ИнтернетПоддержкаПользователей
	//-- Локализация
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
